Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/pic32cm5112gc00100.h
/*
 * Header file for PIC32CM5112GC00100
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* File generated from device description file (ATDF) version 2024-07-26T17:56:39Z */
#ifndef _PIC32CM5112GC00100_H_
#define _PIC32CM5112GC00100_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "2.1.1"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (1)
#define HEADER_FORMAT_VERSION_PATCH (1)

/* PIC32CM5112GC00100 definitions
  This file defines all structures and symbols for PIC32CM5112GC00100:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) x    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) x   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) x   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/*                  CMSIS DEFINITIONS FOR PIC32CM5112GC00100                  */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M23 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/* ************* PIC32CM5112GC00100 specific Interrupt Numbers ************** */
  FCR_IRQn                  =   0, /* 0   Polaris Flash Read Controller (FCR) */
  FCW_IRQn                  =   1, /* 1   Polaris Flash Write Controller (FCW) */
  PM_IRQn                   =   2, /* 2   Power Manager (PM)                  */
  SUPC_IRQn                 =   3, /* 3   Supply Controller (SUPC)            */
  OSCCTRL_XOSCRDY_IRQn      =   4, /* 4   Oscillators Control (OSCCTRL)       */
  OSCCTRL_DFLLRDY_IRQn      =   5, /* 5   Oscillators Control (OSCCTRL)       */
  OSCCTRL_PLLLOCKR_0_IRQn   =   6, /* 6   Oscillators Control (OSCCTRL)       */
  OSC32KCTRL_XOSC32KRDY_IRQn =   7, /* 7   32kHz Oscillators Control (OSC32KCTRL) */
  OSC32KCTRL_XOSC32KFAIL_IRQn =   8, /* 8   32kHz Oscillators Control (OSC32KCTRL) */
  MCLK_IRQn                 =   9, /* 9   Polaris Main Clock Controller (MCLK) */
  FREQM_IRQn                =  10, /* 10  Frequency Meter (FREQM)             */
  WDT_IRQn                  =  11, /* 11  Watchdog Timer (WDT)                */
  RTC_TAMPER_IRQn           =  12, /* 12  Real-Time Counter (RTC)             */
  RTC_OVF_IRQn              =  13, /* 13  Real-Time Counter (RTC)             */
  RTC_PER0_IRQn             =  14, /* 14  Real-Time Counter (RTC)             */
  RTC_CMP0_IRQn             =  15, /* 15  Real-Time Counter (RTC)             */
  EIC_EXTINT0_IRQn          =  16, /* 16  External Interrupt Controller (EIC) */
  EIC_EXTINT1_IRQn          =  17, /* 17  External Interrupt Controller (EIC) */
  EIC_EXTINT2_IRQn          =  18, /* 18  External Interrupt Controller (EIC) */
  EIC_EXTINT3_IRQn          =  19, /* 19  External Interrupt Controller (EIC) */
  EIC_EXTINT4_IRQn          =  20, /* 20  External Interrupt Controller (EIC) */
  EIC_EXTINT5_IRQn          =  21, /* 21  External Interrupt Controller (EIC) */
  EIC_EXTINT6_IRQn          =  22, /* 22  External Interrupt Controller (EIC) */
  EIC_EXTINT7_IRQn          =  23, /* 23  External Interrupt Controller (EIC) */
  EIC_EXTINT8_IRQn          =  24, /* 24  External Interrupt Controller (EIC) */
  EIC_EXTINT9_IRQn          =  25, /* 25  External Interrupt Controller (EIC) */
  EIC_EXTINT10_IRQn         =  26, /* 26  External Interrupt Controller (EIC) */
  EIC_EXTINT11_IRQn         =  27, /* 27  External Interrupt Controller (EIC) */
  EIC_EXTINT12_IRQn         =  28, /* 28  External Interrupt Controller (EIC) */
  EIC_EXTINT13_IRQn         =  29, /* 29  External Interrupt Controller (EIC) */
  EIC_EXTINT14_IRQn         =  30, /* 30  External Interrupt Controller (EIC) */
  EIC_EXTINT15_IRQn         =  31, /* 31  External Interrupt Controller (EIC) */
  EIC_NSCHK_IRQn            =  32, /* 32  External Interrupt Controller (EIC) */
  MCRAMC_IRQn               =  34, /* 34  Multi-Channel RAM Controller (MCRAMC) */
  CAN0_INT0_IRQn            =  35, /* 35  Control Area Network (CAN0)         */
  CAN0_INT1_IRQn            =  36, /* 36  Control Area Network (CAN0)         */
  CAN0_BERR_IRQn            =  37, /* 37  Control Area Network (CAN0)         */
  CAN1_INT0_IRQn            =  38, /* 38  Control Area Network (CAN1)         */
  CAN1_INT1_IRQn            =  39, /* 39  Control Area Network (CAN1)         */
  CAN1_BERR_IRQn            =  40, /* 40  Control Area Network (CAN1)         */
  PORT_IRQn                 =  41, /* 41  Port Module (PORT)                  */
  DMAC_TCMPL0_IRQn          =  42, /* 42  Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL1_IRQn          =  43, /* 43  Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL2_IRQn          =  44, /* 44  Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL3_IRQn          =  45, /* 45  Direct Memory Access Controller (DMAC) */
  DMAC_TCMPL4_IRQn          =  46, /* 46  Direct Memory Access Controller (DMAC) */
  HMATRIX2_IRQn             =  47, /* 47  HSB Matrix (HMATRIX2)               */
  EVSYS_EVD0_IRQn           =  48, /* 48  Event System Interface (EVSYS)      */
  EVSYS_EVD1_IRQn           =  49, /* 49  Event System Interface (EVSYS)      */
  EVSYS_EVD2_IRQn           =  50, /* 50  Event System Interface (EVSYS)      */
  EVSYS_EVD3_IRQn           =  51, /* 51  Event System Interface (EVSYS)      */
  EVSYS_EVD4_IRQn           =  52, /* 52  Event System Interface (EVSYS)      */
  EVSYS_EVD5_IRQn           =  53, /* 53  Event System Interface (EVSYS)      */
  EVSYS_EVD6_IRQn           =  54, /* 54  Event System Interface (EVSYS)      */
  EVSYS_EVD7_IRQn           =  55, /* 55  Event System Interface (EVSYS)      */
  EVSYS_EVD8_IRQn           =  56, /* 56  Event System Interface (EVSYS)      */
  EVSYS_EVD9_IRQn           =  57, /* 57  Event System Interface (EVSYS)      */
  EVSYS_EVD10_IRQn          =  58, /* 58  Event System Interface (EVSYS)      */
  EVSYS_EVD11_IRQn          =  59, /* 59  Event System Interface (EVSYS)      */
  SERCOM0_6_IRQn            =  60, /* 60  Serial Communication Interface (SERCOM0) */
  SERCOM0_5_IRQn            =  61, /* 61  Serial Communication Interface (SERCOM0) */
  SERCOM0_0_IRQn            =  62, /* 62  Serial Communication Interface (SERCOM0) */
  SERCOM0_1_IRQn            =  63, /* 63  Serial Communication Interface (SERCOM0) */
  SERCOM0_2_IRQn            =  64, /* 64  Serial Communication Interface (SERCOM0) */
  SERCOM0_3_IRQn            =  65, /* 65  Serial Communication Interface (SERCOM0) */
  SERCOM0_4_IRQn            =  66, /* 66  Serial Communication Interface (SERCOM0) */
  SERCOM1_6_IRQn            =  67, /* 67  Serial Communication Interface (SERCOM1) */
  SERCOM1_5_IRQn            =  68, /* 68  Serial Communication Interface (SERCOM1) */
  SERCOM1_0_IRQn            =  69, /* 69  Serial Communication Interface (SERCOM1) */
  SERCOM1_1_IRQn            =  70, /* 70  Serial Communication Interface (SERCOM1) */
  SERCOM1_2_IRQn            =  71, /* 71  Serial Communication Interface (SERCOM1) */
  SERCOM1_3_IRQn            =  72, /* 72  Serial Communication Interface (SERCOM1) */
  SERCOM1_4_IRQn            =  73, /* 73  Serial Communication Interface (SERCOM1) */
  SERCOM2_6_IRQn            =  74, /* 74  Serial Communication Interface (SERCOM2) */
  SERCOM2_5_IRQn            =  75, /* 75  Serial Communication Interface (SERCOM2) */
  SERCOM2_0_IRQn            =  76, /* 76  Serial Communication Interface (SERCOM2) */
  SERCOM2_1_IRQn            =  77, /* 77  Serial Communication Interface (SERCOM2) */
  SERCOM2_2_IRQn            =  78, /* 78  Serial Communication Interface (SERCOM2) */
  SERCOM2_3_IRQn            =  79, /* 79  Serial Communication Interface (SERCOM2) */
  SERCOM2_4_IRQn            =  80, /* 80  Serial Communication Interface (SERCOM2) */
  SERCOM3_6_IRQn            =  81, /* 81  Serial Communication Interface (SERCOM3) */
  SERCOM3_5_IRQn            =  82, /* 82  Serial Communication Interface (SERCOM3) */
  SERCOM3_0_IRQn            =  83, /* 83  Serial Communication Interface (SERCOM3) */
  SERCOM3_1_IRQn            =  84, /* 84  Serial Communication Interface (SERCOM3) */
  SERCOM3_2_IRQn            =  85, /* 85  Serial Communication Interface (SERCOM3) */
  SERCOM3_3_IRQn            =  86, /* 86  Serial Communication Interface (SERCOM3) */
  SERCOM3_4_IRQn            =  87, /* 87  Serial Communication Interface (SERCOM3) */
  TCC0_DFS_IRQn             =  88, /* 88  Timer Counter for Control Applications (TCC0) */
  TCC0_CNT_IRQn             =  89, /* 89  Timer Counter for Control Applications (TCC0) */
  TCC0_MC0_IRQn             =  90, /* 90  Timer Counter for Control Applications (TCC0) */
  TCC0_MC1_IRQn             =  91, /* 91  Timer Counter for Control Applications (TCC0) */
  TCC1_DFS_IRQn             =  92, /* 92  Timer Counter for Control Applications (TCC1) */
  TCC1_CNT_IRQn             =  93, /* 93  Timer Counter for Control Applications (TCC1) */
  TCC1_MC0_IRQn             =  94, /* 94  Timer Counter for Control Applications (TCC1) */
  TCC1_MC1_IRQn             =  95, /* 95  Timer Counter for Control Applications (TCC1) */
  TCC2_DFS_IRQn             =  96, /* 96  Timer Counter for Control Applications (TCC2) */
  TCC2_CNT_IRQn             =  97, /* 97  Timer Counter for Control Applications (TCC2) */
  TCC2_MC0_IRQn             =  98, /* 98  Timer Counter for Control Applications (TCC2) */
  TCC2_MC1_IRQn             =  99, /* 99  Timer Counter for Control Applications (TCC2) */
  TCC3_DFS_IRQn             = 100, /* 100 Timer Counter for Control Applications (TCC3) */
  TCC3_CNT_IRQn             = 101, /* 101 Timer Counter for Control Applications (TCC3) */
  TCC3_MC0_IRQn             = 102, /* 102 Timer Counter for Control Applications (TCC3) */
  TCC3_MC1_IRQn             = 103, /* 103 Timer Counter for Control Applications (TCC3) */
  SERCOM4_6_IRQn            = 104, /* 104 Serial Communication Interface (SERCOM4) */
  SERCOM4_5_IRQn            = 105, /* 105 Serial Communication Interface (SERCOM4) */
  SERCOM4_0_IRQn            = 106, /* 106 Serial Communication Interface (SERCOM4) */
  SERCOM4_1_IRQn            = 107, /* 107 Serial Communication Interface (SERCOM4) */
  SERCOM4_2_IRQn            = 108, /* 108 Serial Communication Interface (SERCOM4) */
  SERCOM4_3_IRQn            = 109, /* 109 Serial Communication Interface (SERCOM4) */
  SERCOM4_4_IRQn            = 110, /* 110 Serial Communication Interface (SERCOM4) */
  SERCOM5_6_IRQn            = 111, /* 111 Serial Communication Interface (SERCOM5) */
  SERCOM5_5_IRQn            = 112, /* 112 Serial Communication Interface (SERCOM5) */
  SERCOM5_0_IRQn            = 113, /* 113 Serial Communication Interface (SERCOM5) */
  SERCOM5_1_IRQn            = 114, /* 114 Serial Communication Interface (SERCOM5) */
  SERCOM5_2_IRQn            = 115, /* 115 Serial Communication Interface (SERCOM5) */
  SERCOM5_3_IRQn            = 116, /* 116 Serial Communication Interface (SERCOM5) */
  SERCOM5_4_IRQn            = 117, /* 117 Serial Communication Interface (SERCOM5) */
  TCC4_DFS_IRQn             = 118, /* 118 Timer Counter for Control Applications (TCC4) */
  TCC4_CNT_IRQn             = 119, /* 119 Timer Counter for Control Applications (TCC4) */
  TCC4_MC0_IRQn             = 120, /* 120 Timer Counter for Control Applications (TCC4) */
  TCC4_MC1_IRQn             = 121, /* 121 Timer Counter for Control Applications (TCC4) */
  TCC5_DFS_IRQn             = 122, /* 122 Timer Counter for Control Applications (TCC5) */
  TCC5_CNT_IRQn             = 123, /* 123 Timer Counter for Control Applications (TCC5) */
  TCC5_MC0_IRQn             = 124, /* 124 Timer Counter for Control Applications (TCC5) */
  TCC5_MC1_IRQn             = 125, /* 125 Timer Counter for Control Applications (TCC5) */
  TCC6_DFS_IRQn             = 126, /* 126 Timer Counter for Control Applications (TCC6) */
  TCC6_CNT_IRQn             = 127, /* 127 Timer Counter for Control Applications (TCC6) */
  TCC6_MC0_IRQn             = 128, /* 128 Timer Counter for Control Applications (TCC6) */
  TCC6_MC1_IRQn             = 129, /* 129 Timer Counter for Control Applications (TCC6) */
  ADC_REQ0_IRQn             = 130, /* 130 ADC Controller (ADC)                */
  ADC_REQ1_IRQn             = 131, /* 131 ADC Controller (ADC)                */
  AC_IRQn                   = 132, /* 132 Analog Comparator Controller (AC)   */
  PTC_IRQn                  = 133, /* 133 Polaris Peripheral Touch Controller (PTC) */
  USB_EORSMDNRSM_IRQn       = 134, /* 134 Full-Speed Universal Serial Bus (USB) */
  USB_SOFHSOF_IRQn          = 135, /* 135 Full-Speed Universal Serial Bus (USB) */
  USB_TRCPT00_IRQn          = 136, /* 136 Full-Speed Universal Serial Bus (USB) */
  USB_TRCPT10_IRQn          = 137, /* 137 Full-Speed Universal Serial Bus (USB) */
  AT_IRQn                   = 138, /* 138 Anti-Tamper Controller (AT) (AT)    */

  PERIPH_MAX_IRQn           = 138  /* Max peripheral ID */
} IRQn_Type;
