Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/pic32cm5112gc00100.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M23 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnFCR_Handler;                          /*   0 Polaris Flash Read Controller (FCR) */
  void* pfnFCW_Handler;                          /*   1 Polaris Flash Write Controller (FCW) */
  void* pfnPM_Handler;                           /*   2 Power Manager (PM) */
  void* pfnSUPC_Handler;                         /*   3 Supply Controller (SUPC) */
  void* pfnOSCCTRL_XOSCRDY_Handler;              /*   4 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_DFLLRDY_Handler;              /*   5 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_PLLLOCKR_0_Handler;           /*   6 Oscillators Control (OSCCTRL) */
  void* pfnOSC32KCTRL_XOSC32KRDY_Handler;        /*   7 32kHz Oscillators Control (OSC32KCTRL) */
  void* pfnOSC32KCTRL_XOSC32KFAIL_Handler;       /*   8 32kHz Oscillators Control (OSC32KCTRL) */
  void* pfnMCLK_Handler;                         /*   9 Polaris Main Clock Controller (MCLK) */
  void* pfnFREQM_Handler;                        /*  10 Frequency Meter (FREQM) */
  void* pfnWDT_Handler;                          /*  11 Watchdog Timer (WDT) */
  void* pfnRTC_TAMPER_Handler;                   /*  12 Real-Time Counter (RTC) */
  void* pfnRTC_OVF_Handler;                      /*  13 Real-Time Counter (RTC) */
  void* pfnRTC_PER0_Handler;                     /*  14 Real-Time Counter (RTC) */
  void* pfnRTC_CMP0_Handler;                     /*  15 Real-Time Counter (RTC) */
  void* pfnEIC_EXTINT0_Handler;                  /*  16 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT1_Handler;                  /*  17 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT2_Handler;                  /*  18 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT3_Handler;                  /*  19 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT4_Handler;                  /*  20 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT5_Handler;                  /*  21 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT6_Handler;                  /*  22 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT7_Handler;                  /*  23 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT8_Handler;                  /*  24 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT9_Handler;                  /*  25 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT10_Handler;                 /*  26 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT11_Handler;                 /*  27 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT12_Handler;                 /*  28 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT13_Handler;                 /*  29 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT14_Handler;                 /*  30 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT15_Handler;                 /*  31 External Interrupt Controller (EIC) */
  void* pfnEIC_NSCHK_Handler;                    /*  32 External Interrupt Controller (EIC) */
  void* pvReserved33;
  void* pfnMCRAMC_Handler;                       /*  34 Multi-Channel RAM Controller (MCRAMC) */
  void* pfnCAN0_INT0_Handler;                    /*  35 Control Area Network (CAN0) */
  void* pfnCAN0_INT1_Handler;                    /*  36 Control Area Network (CAN0) */
  void* pfnCAN0_BERR_Handler;                    /*  37 Control Area Network (CAN0) */
  void* pfnCAN1_INT0_Handler;                    /*  38 Control Area Network (CAN1) */
  void* pfnCAN1_INT1_Handler;                    /*  39 Control Area Network (CAN1) */
  void* pfnCAN1_BERR_Handler;                    /*  40 Control Area Network (CAN1) */
  void* pfnPORT_Handler;                         /*  41 Port Module (PORT) */
  void* pfnDMAC_TCMPL0_Handler;                  /*  42 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_TCMPL1_Handler;                  /*  43 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_TCMPL2_Handler;                  /*  44 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_TCMPL3_Handler;                  /*  45 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_TCMPL4_Handler;                  /*  46 Direct Memory Access Controller (DMAC) */
  void* pfnHMATRIX2_Handler;                     /*  47 HSB Matrix (HMATRIX2) */
  void* pfnEVSYS_EVD0_Handler;                   /*  48 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD1_Handler;                   /*  49 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD2_Handler;                   /*  50 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD3_Handler;                   /*  51 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD4_Handler;                   /*  52 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD5_Handler;                   /*  53 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD6_Handler;                   /*  54 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD7_Handler;                   /*  55 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD8_Handler;                   /*  56 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD9_Handler;                   /*  57 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD10_Handler;                  /*  58 Event System Interface (EVSYS) */
  void* pfnEVSYS_EVD11_Handler;                  /*  59 Event System Interface (EVSYS) */
  void* pfnSERCOM0_6_Handler;                    /*  60 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_5_Handler;                    /*  61 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_0_Handler;                    /*  62 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_1_Handler;                    /*  63 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_2_Handler;                    /*  64 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_3_Handler;                    /*  65 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_4_Handler;                    /*  66 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_6_Handler;                    /*  67 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_5_Handler;                    /*  68 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_0_Handler;                    /*  69 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_1_Handler;                    /*  70 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_2_Handler;                    /*  71 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_3_Handler;                    /*  72 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_4_Handler;                    /*  73 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_6_Handler;                    /*  74 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_5_Handler;                    /*  75 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_0_Handler;                    /*  76 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_1_Handler;                    /*  77 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_2_Handler;                    /*  78 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_3_Handler;                    /*  79 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_4_Handler;                    /*  80 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_6_Handler;                    /*  81 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_5_Handler;                    /*  82 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_0_Handler;                    /*  83 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_1_Handler;                    /*  84 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_2_Handler;                    /*  85 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_3_Handler;                    /*  86 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_4_Handler;                    /*  87 Serial Communication Interface (SERCOM3) */
  void* pfnTCC0_DFS_Handler;                     /*  88 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_CNT_Handler;                     /*  89 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC0_Handler;                     /*  90 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC1_Handler;                     /*  91 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC1_DFS_Handler;                     /*  92 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_CNT_Handler;                     /*  93 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC0_Handler;                     /*  94 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC1_Handler;                     /*  95 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC2_DFS_Handler;                     /*  96 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_CNT_Handler;                     /*  97 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC0_Handler;                     /*  98 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC1_Handler;                     /*  99 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC3_DFS_Handler;                     /* 100 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_CNT_Handler;                     /* 101 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC0_Handler;                     /* 102 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC1_Handler;                     /* 103 Timer Counter for Control Applications (TCC3) */
  void* pfnSERCOM4_6_Handler;                    /* 104 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_5_Handler;                    /* 105 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_0_Handler;                    /* 106 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_1_Handler;                    /* 107 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_2_Handler;                    /* 108 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_3_Handler;                    /* 109 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_4_Handler;                    /* 110 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM5_6_Handler;                    /* 111 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_5_Handler;                    /* 112 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_0_Handler;                    /* 113 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_1_Handler;                    /* 114 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_2_Handler;                    /* 115 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_3_Handler;                    /* 116 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_4_Handler;                    /* 117 Serial Communication Interface (SERCOM5) */
  void* pfnTCC4_DFS_Handler;                     /* 118 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_CNT_Handler;                     /* 119 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_MC0_Handler;                     /* 120 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_MC1_Handler;                     /* 121 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC5_DFS_Handler;                     /* 122 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_CNT_Handler;                     /* 123 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_MC0_Handler;                     /* 124 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_MC1_Handler;                     /* 125 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC6_DFS_Handler;                     /* 126 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_CNT_Handler;                     /* 127 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_MC0_Handler;                     /* 128 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_MC1_Handler;                     /* 129 Timer Counter for Control Applications (TCC6) */
  void* pfnADC_REQ0_Handler;                     /* 130 ADC Controller (ADC) */
  void* pfnADC_REQ1_Handler;                     /* 131 ADC Controller (ADC) */
  void* pfnAC_Handler;                           /* 132 Analog Comparator Controller (AC) */
  void* pfnPTC_Handler;                          /* 133 Polaris Peripheral Touch Controller (PTC) */
  void* pfnUSB_EORSMDNRSM_Handler;               /* 134 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSB_SOFHSOF_Handler;                  /* 135 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSB_TRCPT00_Handler;                  /* 136 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSB_TRCPT10_Handler;                  /* 137 Full-Speed Universal Serial Bus (USB) */
  void* pfnAT_Handler;                           /* 138 Anti-Tamper Controller (AT) (AT) */
} DeviceVectors;

