Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/pic32cm5112gc00100.h
#define BROMC_ROM_ADDR                 _UINT32_(0x04000000)    /* BROMC_ROM base address (type: rom)*/
#define FCR_BFM_ADDR                   _UINT32_(0x08000000)    /* FCR_BFM base address (type: flash)*/
#define FCR_CFM_BOOTCFG1A_ADDR         _UINT32_(0x0a000000)    /* FCR_CFM_BOOTCFG1A base address (type: flash)*/
#define FCR_CFM_USEROTP_ADDR           _UINT32_(0x0a001000)    /* FCR_CFM_USEROTP base address (type: user_signatures)*/
#define FCR_CFM_BOOTCFG1_ADDR          _UINT32_(0x0a002000)    /* FCR_CFM_BOOTCFG1 base address (type: flash)*/
#define FCR_CFM_ROMCFG_ADDR            _UINT32_(0x0a003000)    /* FCR_CFM_ROMCFG base address (type: flash)*/
#define FCR_CFM_VSS0_ADDR              _UINT32_(0x0a004000)    /* FCR_CFM_VSS0 base address (type: flash)*/
#define FCR_CFM_VSS1_ADDR              _UINT32_(0x0a005000)    /* FCR_CFM_VSS1 base address (type: flash)*/
#define FCR_CFM_TEST_ADDR              _UINT32_(0x0a006000)    /* FCR_CFM_TEST base address (type: flash)*/
#define FCR_CFM_CALOTP_ADDR            _UINT32_(0x0a007000)    /* FCR_CFM_CALOTP base address (type: other)*/
#define FCR_PFM_ADDR                   _UINT32_(0x0c000000)    /* FCR_PFM base address (type: flash)*/
#define MCRAMC_RET_ADDR                _UINT32_(0x20000000)    /* MCRAMC_RET base address (type: ram)*/
#define APB0_BRIDGE_ADDR               _UINT32_(0x44000000)    /* APB0_BRIDGE base address (type: io)*/
#define APB1_BRIDGE_ADDR               _UINT32_(0x44800000)    /* APB1_BRIDGE base address (type: io)*/
#define APB2_BRIDGE_ADDR               _UINT32_(0x45000000)    /* APB2_BRIDGE base address (type: io)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*                  DEVICE SIGNATURES FOR PIC32CM5112GC00100                  */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X0AC00053)

/* ************************************************************************** */
/*               ELECTRICAL DEFINITIONS FOR PIC32CM5112GC00100                */
/* ************************************************************************** */

/* ************************************************************************** */
/*                  Event Generator IDs for C32CM5112GC00100                  */
/* ************************************************************************** */
#define EVENT_ID_GEN_SUPC_LVDET                           1 /* ID for SUPC event generator LVDET */
#define EVENT_ID_GEN_OSCCTRL_XOSCFAIL                     2 /* ID for OSCCTRL event generator XOSCFAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32KFAIL               3 /* ID for OSC32KCTRL event generator XOSC32KFAIL */
#define EVENT_ID_GEN_FREQM_DONE                           4 /* ID for FREQM event generator DONE */
#define EVENT_ID_GEN_FREQM_WINMON                         5 /* ID for FREQM event generator WINMON */
#define EVENT_ID_GEN_RTC_PER0                             6 /* ID for RTC event generator PER0 */
#define EVENT_ID_GEN_RTC_PER1                             7 /* ID for RTC event generator PER1 */
#define EVENT_ID_GEN_RTC_PER2                             8 /* ID for RTC event generator PER2 */
#define EVENT_ID_GEN_RTC_PER3                             9 /* ID for RTC event generator PER3 */
#define EVENT_ID_GEN_RTC_PER4                            10 /* ID for RTC event generator PER4 */
#define EVENT_ID_GEN_RTC_PER5                            11 /* ID for RTC event generator PER5 */
#define EVENT_ID_GEN_RTC_PER6                            12 /* ID for RTC event generator PER6 */
#define EVENT_ID_GEN_RTC_PER7                            13 /* ID for RTC event generator PER7 */
#define EVENT_ID_GEN_RTC_CMP0                            14 /* ID for RTC event generator CMP0 */
#define EVENT_ID_GEN_RTC_CMP1                            15 /* ID for RTC event generator CMP1 */
#define EVENT_ID_GEN_RTC_CMP2                            16 /* ID for RTC event generator CMP2 */
#define EVENT_ID_GEN_RTC_CMP3                            17 /* ID for RTC event generator CMP3 */
#define EVENT_ID_GEN_RTC_TAMPER                          18 /* ID for RTC event generator TAMPER */
#define EVENT_ID_GEN_RTC_OVF                             19 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PERD                            20 /* ID for RTC event generator PERD */
#define EVENT_ID_GEN_EIC_EXTINT0                         21 /* ID for EIC event generator EXTINT0 */
#define EVENT_ID_GEN_EIC_EXTINT1                         22 /* ID for EIC event generator EXTINT1 */
#define EVENT_ID_GEN_EIC_EXTINT2                         23 /* ID for EIC event generator EXTINT2 */
#define EVENT_ID_GEN_EIC_EXTINT3                         24 /* ID for EIC event generator EXTINT3 */
#define EVENT_ID_GEN_EIC_EXTINT4                         25 /* ID for EIC event generator EXTINT4 */
#define EVENT_ID_GEN_EIC_EXTINT5                         26 /* ID for EIC event generator EXTINT5 */
#define EVENT_ID_GEN_EIC_EXTINT6                         27 /* ID for EIC event generator EXTINT6 */
#define EVENT_ID_GEN_EIC_EXTINT7                         28 /* ID for EIC event generator EXTINT7 */
#define EVENT_ID_GEN_EIC_EXTINT8                         29 /* ID for EIC event generator EXTINT8 */
#define EVENT_ID_GEN_EIC_EXTINT9                         30 /* ID for EIC event generator EXTINT9 */
#define EVENT_ID_GEN_EIC_EXTINT10                        31 /* ID for EIC event generator EXTINT10 */
#define EVENT_ID_GEN_EIC_EXTINT11                        32 /* ID for EIC event generator EXTINT11 */
#define EVENT_ID_GEN_EIC_EXTINT12                        33 /* ID for EIC event generator EXTINT12 */
#define EVENT_ID_GEN_EIC_EXTINT13                        34 /* ID for EIC event generator EXTINT13 */
#define EVENT_ID_GEN_EIC_EXTINT14                        35 /* ID for EIC event generator EXTINT14 */
#define EVENT_ID_GEN_EIC_EXTINT15                        36 /* ID for EIC event generator EXTINT15 */
#define EVENT_ID_GEN_DMAC_CH0                            37 /* ID for DMAC event generator CH0 */
#define EVENT_ID_GEN_DMAC_CH1                            38 /* ID for DMAC event generator CH1 */
#define EVENT_ID_GEN_DMAC_CH2                            39 /* ID for DMAC event generator CH2 */
#define EVENT_ID_GEN_DMAC_CH3                            40 /* ID for DMAC event generator CH3 */
#define EVENT_ID_GEN_TCC0_OVF                            41 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            42 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            43 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC0                            44 /* ID for TCC0 event generator MC0 */
#define EVENT_ID_GEN_TCC0_MC1                            45 /* ID for TCC0 event generator MC1 */
#define EVENT_ID_GEN_TCC1_OVF                            46 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            47 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            48 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC0                            49 /* ID for TCC1 event generator MC0 */
#define EVENT_ID_GEN_TCC1_MC1                            50 /* ID for TCC1 event generator MC1 */
#define EVENT_ID_GEN_TCC2_OVF                            51 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            52 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            53 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC0                            54 /* ID for TCC2 event generator MC0 */
#define EVENT_ID_GEN_TCC2_MC1                            55 /* ID for TCC2 event generator MC1 */
#define EVENT_ID_GEN_TCC3_OVF                            56 /* ID for TCC3 event generator OVF */
#define EVENT_ID_GEN_TCC3_TRG                            57 /* ID for TCC3 event generator TRG */
#define EVENT_ID_GEN_TCC3_CNT                            58 /* ID for TCC3 event generator CNT */
#define EVENT_ID_GEN_TCC3_MC0                            59 /* ID for TCC3 event generator MC0 */
#define EVENT_ID_GEN_TCC3_MC1                            60 /* ID for TCC3 event generator MC1 */
#define EVENT_ID_GEN_TCC4_OVF                            61 /* ID for TCC4 event generator OVF */
#define EVENT_ID_GEN_TCC4_TRG                            62 /* ID for TCC4 event generator TRG */
#define EVENT_ID_GEN_TCC4_CNT                            63 /* ID for TCC4 event generator CNT */
#define EVENT_ID_GEN_TCC4_MC0                            64 /* ID for TCC4 event generator MC0 */
#define EVENT_ID_GEN_TCC4_MC1                            65 /* ID for TCC4 event generator MC1 */
#define EVENT_ID_GEN_TCC5_OVF                            66 /* ID for TCC5 event generator OVF */
#define EVENT_ID_GEN_TCC5_TRG                            67 /* ID for TCC5 event generator TRG */
#define EVENT_ID_GEN_TCC5_CNT                            68 /* ID for TCC5 event generator CNT */
#define EVENT_ID_GEN_TCC5_MC0                            69 /* ID for TCC5 event generator MC0 */
#define EVENT_ID_GEN_TCC5_MC1                            70 /* ID for TCC5 event generator MC1 */
#define EVENT_ID_GEN_TCC6_OVF                            71 /* ID for TCC6 event generator OVF */
#define EVENT_ID_GEN_TCC6_TRG                            72 /* ID for TCC6 event generator TRG */
#define EVENT_ID_GEN_TCC6_CNT                            73 /* ID for TCC6 event generator CNT */
#define EVENT_ID_GEN_TCC6_MC0                            74 /* ID for TCC6 event generator MC0 */
#define EVENT_ID_GEN_TCC6_MC1                            75 /* ID for TCC6 event generator MC1 */
#define EVENT_ID_GEN_ADC_CHRDY                           76 /* ID for ADC event generator CHRDY */
#define EVENT_ID_GEN_ADC_CMP                             77 /* ID for ADC event generator CMP */
#define EVENT_ID_GEN_AC_COMP0                            78 /* ID for AC event generator COMP0 */
#define EVENT_ID_GEN_AC_COMP1                            79 /* ID for AC event generator COMP1 */
#define EVENT_ID_GEN_AC_WIN0                             80 /* ID for AC event generator WIN0 */
#define EVENT_ID_GEN_PTC_EOC                             81 /* ID for PTC event generator EOC */
#define EVENT_ID_GEN_PTC_WCOMP                           82 /* ID for PTC event generator WCOMP */
#define EVENT_ID_GEN_CCL0_LUTOUT0                        83 /* ID for CCL0 event generator LUTOUT0 */
#define EVENT_ID_GEN_CCL0_LUTOUT1                        84 /* ID for CCL0 event generator LUTOUT1 */
#define EVENT_ID_GEN_CCL0_LUTOUT2                        85 /* ID for CCL0 event generator LUTOUT2 */
#define EVENT_ID_GEN_CCL0_LUTOUT3                        86 /* ID for CCL0 event generator LUTOUT3 */
#define EVENT_ID_GEN_CCL1_LUTOUT0                        87 /* ID for CCL1 event generator LUTOUT0 */
#define EVENT_ID_GEN_CCL1_LUTOUT1                        88 /* ID for CCL1 event generator LUTOUT1 */
#define EVENT_ID_GEN_CCL1_LUTOUT2                        89 /* ID for CCL1 event generator LUTOUT2 */
#define EVENT_ID_GEN_CCL1_LUTOUT3                        90 /* ID for CCL1 event generator LUTOUT3 */

/* ************************************************************************** */
/*                    Event User IDs for C32CM5112GC00100                     */
/* ************************************************************************** */
#define EVENT_ID_USER_FREQM_START                         0 /* ID for FREQM event user START */
#define EVENT_ID_USER_RTC_TAMPER                          1 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_PORT_EV0                            2 /* ID for PORT event user EV0 */
#define EVENT_ID_USER_PORT_EV1                            3 /* ID for PORT event user EV1 */
#define EVENT_ID_USER_PORT_EV2                            4 /* ID for PORT event user EV2 */
#define EVENT_ID_USER_PORT_EV3                            5 /* ID for PORT event user EV3 */
#define EVENT_ID_USER_DMAC_CH0                            6 /* ID for DMAC event user CH0 */
#define EVENT_ID_USER_DMAC_CH1                            7 /* ID for DMAC event user CH1 */
#define EVENT_ID_USER_DMAC_CH2                            8 /* ID for DMAC event user CH2 */
#define EVENT_ID_USER_DMAC_CH3                            9 /* ID for DMAC event user CH3 */
#define EVENT_ID_USER_TCC0_EV0                           10 /* ID for TCC0 event user EV0 */
#define EVENT_ID_USER_TCC0_EV1                           11 /* ID for TCC0 event user EV1 */
#define EVENT_ID_USER_TCC0_MC0                           12 /* ID for TCC0 event user MC0 */
#define EVENT_ID_USER_TCC0_MC1                           13 /* ID for TCC0 event user MC1 */
#define EVENT_ID_USER_TCC1_EV0                           14 /* ID for TCC1 event user EV0 */
#define EVENT_ID_USER_TCC1_EV1                           15 /* ID for TCC1 event user EV1 */
#define EVENT_ID_USER_TCC1_MC0                           16 /* ID for TCC1 event user MC0 */
#define EVENT_ID_USER_TCC1_MC1                           17 /* ID for TCC1 event user MC1 */
#define EVENT_ID_USER_TCC2_EV0                           18 /* ID for TCC2 event user EV0 */
#define EVENT_ID_USER_TCC2_EV1                           19 /* ID for TCC2 event user EV1 */
#define EVENT_ID_USER_TCC2_MC0                           20 /* ID for TCC2 event user MC0 */
#define EVENT_ID_USER_TCC2_MC1                           21 /* ID for TCC2 event user MC1 */
#define EVENT_ID_USER_TCC3_EV0                           22 /* ID for TCC3 event user EV0 */
#define EVENT_ID_USER_TCC3_EV1                           23 /* ID for TCC3 event user EV1 */
#define EVENT_ID_USER_TCC3_MC0                           24 /* ID for TCC3 event user MC0 */
#define EVENT_ID_USER_TCC3_MC1                           25 /* ID for TCC3 event user MC1 */
#define EVENT_ID_USER_TCC4_EV0                           26 /* ID for TCC4 event user EV0 */
#define EVENT_ID_USER_TCC4_EV1                           27 /* ID for TCC4 event user EV1 */
#define EVENT_ID_USER_TCC4_MC0                           28 /* ID for TCC4 event user MC0 */
#define EVENT_ID_USER_TCC4_MC1                           29 /* ID for TCC4 event user MC1 */
#define EVENT_ID_USER_TCC5_EV0                           30 /* ID for TCC5 event user EV0 */
#define EVENT_ID_USER_TCC5_EV1                           31 /* ID for TCC5 event user EV1 */
#define EVENT_ID_USER_TCC5_MC0                           32 /* ID for TCC5 event user MC0 */
#define EVENT_ID_USER_TCC5_MC1                           33 /* ID for TCC5 event user MC1 */
#define EVENT_ID_USER_TCC6_EV0                           34 /* ID for TCC6 event user EV0 */
#define EVENT_ID_USER_TCC6_EV1                           35 /* ID for TCC6 event user EV1 */
#define EVENT_ID_USER_TCC6_MC0                           36 /* ID for TCC6 event user MC0 */
#define EVENT_ID_USER_TCC6_MC1                           37 /* ID for TCC6 event user MC1 */
#define EVENT_ID_USER_ADC_TRIG0                          38 /* ID for ADC event user TRIG0 */
#define EVENT_ID_USER_ADC_TRIG1                          39 /* ID for ADC event user TRIG1 */
#define EVENT_ID_USER_ADC_TRIG2                          40 /* ID for ADC event user TRIG2 */
#define EVENT_ID_USER_ADC_TRIG3                          41 /* ID for ADC event user TRIG3 */
#define EVENT_ID_USER_ADC_TRIG4                          42 /* ID for ADC event user TRIG4 */
#define EVENT_ID_USER_ADC_TRIG5                          43 /* ID for ADC event user TRIG5 */
#define EVENT_ID_USER_ADC_TRIG6                          44 /* ID for ADC event user TRIG6 */
#define EVENT_ID_USER_ADC_TRIG7                          45 /* ID for ADC event user TRIG7 */
#define EVENT_ID_USER_ADC_TRIG8                          46 /* ID for ADC event user TRIG8 */
#define EVENT_ID_USER_ADC_TRIG9                          47 /* ID for ADC event user TRIG9 */
#define EVENT_ID_USER_ADC_TRIG10                         48 /* ID for ADC event user TRIG10 */
#define EVENT_ID_USER_AC_SOC0                            49 /* ID for AC event user SOC0 */
#define EVENT_ID_USER_AC_SOC1                            50 /* ID for AC event user SOC1 */
#define EVENT_ID_USER_PTC_DSEQR                          51 /* ID for PTC event user DSEQR */
#define EVENT_ID_USER_PTC_STCONV                         52 /* ID for PTC event user STCONV */
#define EVENT_ID_USER_CCL0_LUTIN0                        53 /* ID for CCL0 event user LUTIN0 */
#define EVENT_ID_USER_CCL0_LUTIN1                        54 /* ID for CCL0 event user LUTIN1 */
#define EVENT_ID_USER_CCL0_LUTIN2                        55 /* ID for CCL0 event user LUTIN2 */
#define EVENT_ID_USER_CCL0_LUTIN3                        56 /* ID for CCL0 event user LUTIN3 */
#define EVENT_ID_USER_CCL1_LUTIN0                        57 /* ID for CCL1 event user LUTIN0 */
#define EVENT_ID_USER_CCL1_LUTIN1                        58 /* ID for CCL1 event user LUTIN1 */
#define EVENT_ID_USER_CCL1_LUTIN2                        59 /* ID for CCL1 event user LUTIN2 */
#define EVENT_ID_USER_CCL1_LUTIN3                        60 /* ID for CCL1 event user LUTIN3 */
#define EVENT_ID_USER_AT_TAMPSRC5                        61 /* ID for AT event user TAMPSRC5 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CM5112GC00100_H_ */

